In [1]:
import sqlite3
import pandas as pd

In [2]:
db = sqlite3.connect('users.sqlite')
db

In [3]:
data = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['asuna', 'mikasa', 'eren']
}, columns=['id', 'name'])

data

   id    name
0   1   asuna
1   2  mikasa
2   3    eren

In [4]:
data.to_sql('users', db, index=False)

3

In [5]:
newData = pd.DataFrame({
    'id': [6, 7, 8, 9],
    'name': ['sasha', 'victor', 'kirito', 'goku']
}, columns=['id', 'name'])

newData

   id    name
0   6   sasha
1   7  victor
2   8  kirito
3   9    goku

In [6]:
data =pd.concat([data, newData], ignore_index=True)

In [7]:
data.to_sql('users', db, if_exists='replace', index=False)

7

In [8]:
pd.read_sql('select * from users', db)

   id    name
0   1   asuna
1   2  mikasa
2   3    eren
3   6   sasha
4   7  victor
5   8  kirito
6   9    goku

In [9]:
db.close()